directories = {"Пол пациента":
                   [{"code": 1, "title": "Мужской"}, {"code": 2, "title": "Женский"}],
               "Вид места жительства":
                   [{"code": 1, "title": "Мужской"}, {"code": 2, "title": "Женский"}],
               "Виды медицинской документации":
                   [{"code": 13, "title": "Медицинское свидетельство о смерти"}],
               "Родственные и иные связи":
                   [{"code": 1, "title": "Мать"}],
               "Семейное положение":
                   [{"code": 1, "title": "состоит в зарегистрированном браке"}, {"code": 2, "title": "не состоит в зарегистрированном браке"},
                    {"code": 3, "title": "неизвестно"}],
               "Классификатор образования для медицинских свидетельств":
                   [{"code": 1, "title": "профессиональное: высшее"},
                    {"code": 2, "title": "профессиональное: неполное высшее"},
                    {"code": 3, "title": "профессиональное: среднее"},
                    {"code": 4, "title": "профессиональное: начальное"},
                    {"code": 5, "title": "общее: среднее (полное)"},
                    {"code": 6, "title": "общее: основное"},
                    {"code": 7, "title": "общее: начальное"},
                    {"code": 8, "title": "не имеет образования"},
                    {"code": 9, "title": "неизвестно"},
                    ],
               "Занятость":
                   [{"code": 1, "title": "занятость в экономике: руководители и специалистам высшего уровня квалификаци"},
                    {"code": 2, "title": "занятость в экономике: прочие специалисты"},
                    {"code": 3, "title": "занятость в экономике: квалифицированные рабочие"},
                    {"code": 4, "title": "занятость в экономике: неквалифицированные рабочие"},
                    {"code": 5, "title": "занятость в экономике: занятые на военной службе"},
                    {"code": 6, "title": "отсутствие занятости в экономике: пенсионеры"},
                    {"code": 7, "title": "отсутствие занятости в экономике: студенты и учащиеся"},
                    ],
               "Вид медицинского свидетельства о смерти":
                   [{"code": 1, "title": "окончательное"},
                    {"code": 2, "title": "предварительное"},
                    {"code": 3, "title": "взамен предварительногое"},
                    {"code": 4, "title": "взамен окончательного"},
                    ],
               "Типы мест наступления смерти":
                   [{"code": 1, "title": "на месте происшествия"},
                    {"code": 2, "title": "в машине скорой помощи"},
                    {"code": 3, "title": "в стационаре"},
                    {"code": 4, "title": "дома"},
                    {"code": 4, "title": "в другом месте"},
                    {"code": 5, "title": "неизвестно"},
                    ],
               "Род причины смерти":
                   [{"code": 1, "title": "от заболевания"},
                    {"code": 2, "title": "от несчастного случая, не связанного с производством"},
                    {"code": 3, "title": "от несчастного случая, связанного с производством"},
                    {"code": 4, "title": "убийства"},
                    {"code": 5, "title": "самоубийства"},
                    {"code": 6, "title": "в ходе военных действий"},
                    {"code": 7, "title": "в ходе террористических д"},
                    ],
               "Основания для установления причины смерти":
                   [{"code": 1, "title": "осмотр трупа"},
                    {"code": 2, "title": "записи в медицинской документации"},
                    {"code": 3, "title": "предшествующее наблюдение за больным(ой)"},
                    {"code": 4, "title": "вскрытие"},
                    ],
               "Связь смерти с ДТП":
                   [{"code": 1, "title": "в течение 30 суток"},
                    {"code": 2, "title": "из них в течение 7 суток"},
                    ],
               "Связь смерти с беременностью":
                   [{"code": 1, "title": "смерть беременной (независимо от срока и локализации)"},
                    {"code": 2, "title": "в процессе родов (аборта)"},
                    {"code": 3, "title": "в течение 42 дней после окончания беременности, родов (аборта)"},
                    {"code": 4, "title": "в течение 43-365 дней после окончания беременности, родов"},
                    ],
               }
